experiments/raw-data/envB-medium-20260505-142556/k6-output.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: /scripts/medium.js
        output: Prometheus remote write (http://prometheus:9090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 30 max VUs, 5m0s max duration (incl. graceful stop):
              * default: Up to 30 looping VUs for 4m30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/30 VUs, 4 complete and 0 interrupted iterations
default   [   0% ] 01/30 VUs  0m01.0s/4m30.0s

running (0m02.0s), 01/30 VUs, 8 complete and 0 interrupted iterations
default   [   1% ] 01/30 VUs  0m02.0s/4m30.0s

running (0m03.0s), 02/30 VUs, 15 complete and 0 interrupted iterations
default   [   1% ] 02/30 VUs  0m03.0s/4m30.0s

running (0m04.0s), 02/30 VUs, 18 complete and 0 interrupted iterations
default   [   1% ] 02/30 VUs  0m04.0s/4m30.0s

running (0m05.0s), 03/30 VUs, 25 complete and 0 interrupted iterations
default   [   2% ] 03/30 VUs  0m05.0s/4m30.0s

running (0m06.0s), 03/30 VUs, 35 complete and 0 interrupted iterations
default   [   2% ] 03/30 VUs  0m06.0s/4m30.0s

running (0m07.0s), 04/30 VUs, 48 complete and 0 interrupted iterations
default   [   3% ] 04/30 VUs  0m07.0s/4m30.0s

running (0m08.0s), 04/30 VUs, 61 complete and 0 interrupted iterations
default   [   3% ] 04/30 VUs  0m08.0s/4m30.0s

running (0m09.0s), 05/30 VUs, 74 complete and 0 interrupted iterations
default   [   3% ] 05/30 VUs  0m09.0s/4m30.0s

running (0m10.0s), 05/30 VUs, 92 complete and 0 interrupted iterations
default   [   4% ] 05/30 VUs  0m10.0s/4m30.0s

running (0m11.0s), 06/30 VUs, 114 complete and 0 interrupted iterations
default   [   4% ] 06/30 VUs  0m11.0s/4m30.0s

running (0m12.0s), 06/30 VUs, 135 complete and 0 interrupted iterations
default   [   4% ] 06/30 VUs  0m12.0s/4m30.0s

running (0m13.0s), 07/30 VUs, 158 complete and 0 interrupted iterations
default   [   5% ] 07/30 VUs  0m13.0s/4m30.0s

running (0m14.0s), 07/30 VUs, 185 complete and 0 interrupted iterations
default   [   5% ] 07/30 VUs  0m14.0s/4m30.0s

running (0m15.0s), 08/30 VUs, 214 complete and 0 interrupted iterations
default   [   6% ] 08/30 VUs  0m15.0s/4m30.0s

running (0m16.0s), 08/30 VUs, 246 complete and 0 interrupted iterations
default   [   6% ] 08/30 VUs  0m16.0s/4m30.0s

running (0m17.0s), 09/30 VUs, 249 complete and 0 interrupted iterations
default   [   6% ] 09/30 VUs  0m17.0s/4m30.0s

running (0m18.0s), 09/30 VUs, 249 complete and 0 interrupted iterations
default   [   7% ] 09/30 VUs  0m18.0s/4m30.0s

running (0m19.0s), 10/30 VUs, 273 complete and 0 interrupted iterations
default   [   7% ] 10/30 VUs  0m19.0s/4m30.0s

running (0m20.0s), 10/30 VUs, 302 complete and 0 interrupted iterations
default   [   7% ] 10/30 VUs  0m20.0s/4m30.0s

running (0m21.0s), 11/30 VUs, 315 complete and 0 interrupted iterations
default   [   8% ] 11/30 VUs  0m21.0s/4m30.0s

running (0m22.0s), 11/30 VUs, 339 complete and 0 interrupted iterations
default   [   8% ] 11/30 VUs  0m22.0s/4m30.0s

running (0m23.0s), 12/30 VUs, 375 complete and 0 interrupted iterations
default   [   9% ] 12/30 VUs  0m23.0s/4m30.0s

running (0m24.0s), 12/30 VUs, 406 complete and 0 interrupted iterations
default   [   9% ] 12/30 VUs  0m24.0s/4m30.0s

running (0m25.0s), 13/30 VUs, 406 complete and 0 interrupted iterations
default   [   9% ] 13/30 VUs  0m25.0s/4m30.0s

running (0m26.0s), 13/30 VUs, 408 complete and 0 interrupted iterations
default   [  10% ] 13/30 VUs  0m26.0s/4m30.0s

running (0m27.0s), 14/30 VUs, 442 complete and 0 interrupted iterations
default   [  10% ] 14/30 VUs  0m27.0s/4m30.0s

running (0m28.0s), 14/30 VUs, 443 complete and 0 interrupted iterations
default   [  10% ] 14/30 VUs  0m28.0s/4m30.0s

running (0m29.0s), 15/30 VUs, 446 complete and 0 interrupted iterations
default   [  11% ] 15/30 VUs  0m29.0s/4m30.0s

running (0m30.0s), 15/30 VUs, 463 complete and 0 interrupted iterations
default   [  11% ] 15/30 VUs  0m30.0s/4m30.0s

running (0m31.0s), 15/30 VUs, 465 complete and 0 interrupted iterations
default   [  11% ] 15/30 VUs  0m31.0s/4m30.0s

running (0m32.0s), 16/30 VUs, 475 complete and 0 interrupted iterations
default   [  12% ] 16/30 VUs  0m32.0s/4m30.0s

running (0m33.0s), 16/30 VUs, 515 complete and 0 interrupted iterations
default   [  12% ] 16/30 VUs  0m33.0s/4m30.0s

running (0m34.0s), 17/30 VUs, 552 complete and 0 interrupted iterations
default   [  13% ] 17/30 VUs  0m34.0s/4m30.0s

running (0m35.0s), 17/30 VUs, 605 complete and 0 interrupted iterations
default   [  13% ] 17/30 VUs  0m35.0s/4m30.0s

running (0m36.0s), 18/30 VUs, 654 complete and 0 interrupted iterations
default   [  13% ] 18/30 VUs  0m36.0s/4m30.0s

running (0m37.0s), 18/30 VUs, 655 complete and 0 interrupted iterations
default   [  14% ] 18/30 VUs  0m37.0s/4m30.0s

running (0m38.0s), 19/30 VUs, 660 complete and 0 interrupted iterations
default   [  14% ] 19/30 VUs  0m38.0s/4m30.0s

running (0m39.0s), 19/30 VUs, 702 complete and 0 interrupted iterations
default   [  14% ] 19/30 VUs  0m39.0s/4m30.0s

running (0m40.0s), 20/30 VUs, 716 complete and 0 interrupted iterations
default   [  15% ] 20/30 VUs  0m40.0s/4m30.0s

running (0m41.0s), 20/30 VUs, 718 complete and 0 interrupted iterations
default   [  15% ] 20/30 VUs  0m41.0s/4m30.0s

running (0m42.0s), 21/30 VUs, 767 complete and 0 interrupted iterations
default   [  16% ] 21/30 VUs  0m42.0s/4m30.0s

running (0m43.0s), 21/30 VUs, 811 complete and 0 interrupted iterations
default   [  16% ] 21/30 VUs  0m43.0s/4m30.0s

running (0m44.0s), 22/30 VUs, 840 complete and 0 interrupted iterations
default   [  16% ] 22/30 VUs  0m44.0s/4m30.0s

running (0m45.0s), 22/30 VUs, 857 complete and 0 interrupted iterations
default   [  17% ] 22/30 VUs  0m45.0s/4m30.0s

running (0m46.0s), 23/30 VUs, 885 complete and 0 interrupted iterations
default   [  17% ] 23/30 VUs  0m46.0s/4m30.0s

running (0m47.0s), 23/30 VUs, 923 complete and 0 interrupted iterations
default   [  17% ] 23/30 VUs  0m47.0s/4m30.0s

running (0m48.0s), 24/30 VUs, 952 complete and 0 interrupted iterations
default   [  18% ] 24/30 VUs  0m48.0s/4m30.0s

running (0m49.0s), 24/30 VUs, 954 complete and 0 interrupted iterations
default   [  18% ] 24/30 VUs  0m49.0s/4m30.0s

running (0m50.0s), 25/30 VUs, 964 complete and 0 interrupted iterations
default   [  19% ] 25/30 VUs  0m50.0s/4m30.0s

running (0m51.0s), 25/30 VUs, 1006 complete and 0 interrupted iterations
default   [  19% ] 25/30 VUs  0m51.0s/4m30.0s

running (0m52.0s), 26/30 VUs, 1008 complete and 0 interrupted iterations
default   [  19% ] 26/30 VUs  0m52.0s/4m30.0s

running (0m53.0s), 26/30 VUs, 1015 complete and 0 interrupted iterations
default   [  20% ] 26/30 VUs  0m53.0s/4m30.0s

running (0m54.0s), 27/30 VUs, 1060 complete and 0 interrupted iterations
default   [  20% ] 27/30 VUs  0m54.0s/4m30.0s

running (0m55.0s), 27/30 VUs, 1071 complete and 0 interrupted iterations
default   [  20% ] 27/30 VUs  0m55.0s/4m30.0s

running (0m56.0s), 28/30 VUs, 1071 complete and 0 interrupted iterations
default   [  21% ] 28/30 VUs  0m56.0s/4m30.0s

running (0m57.0s), 28/30 VUs, 1104 complete and 0 interrupted iterations
default   [  21% ] 28/30 VUs  0m57.0s/4m30.0s

running (0m58.0s), 29/30 VUs, 1112 complete and 0 interrupted iterations
default   [  21% ] 29/30 VUs  0m58.0s/4m30.0s

running (0m59.0s), 29/30 VUs, 1112 complete and 0 interrupted iterations
default   [  22% ] 29/30 VUs  0m59.0s/4m30.0s

running (1m00.0s), 29/30 VUs, 1152 complete and 0 interrupted iterations
default   [  22% ] 29/30 VUs  1m00.0s/4m30.0s

running (1m01.0s), 30/30 VUs, 1228 complete and 0 interrupted iterations
default   [  23% ] 30/30 VUs  1m01.0s/4m30.0s

running (1m02.0s), 30/30 VUs, 1248 complete and 0 interrupted iterations
default   [  23% ] 30/30 VUs  1m02.0s/4m30.0s

running (1m03.0s), 30/30 VUs, 1248 complete and 0 interrupted iterations
default   [  23% ] 30/30 VUs  1m03.0s/4m30.0s

running (1m04.0s), 30/30 VUs, 1292 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  1m04.0s/4m30.0s

running (1m05.0s), 30/30 VUs, 1338 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  1m05.0s/4m30.0s

running (1m06.0s), 30/30 VUs, 1341 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  1m06.0s/4m30.0s

running (1m07.0s), 30/30 VUs, 1344 complete and 0 interrupted iterations
default   [  25% ] 30/30 VUs  1m07.0s/4m30.0s

running (1m08.0s), 30/30 VUs, 1394 complete and 0 interrupted iterations
default   [  25% ] 30/30 VUs  1m08.0s/4m30.0s

running (1m09.0s), 30/30 VUs, 1415 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  1m09.0s/4m30.0s

running (1m10.0s), 30/30 VUs, 1415 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  1m10.0s/4m30.0s

running (1m11.0s), 30/30 VUs, 1431 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  1m11.0s/4m30.0s

running (1m12.0s), 30/30 VUs, 1470 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  1m12.0s/4m30.0s

running (1m13.0s), 30/30 VUs, 1502 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  1m13.0s/4m30.0s

running (1m14.0s), 30/30 VUs, 1539 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  1m14.0s/4m30.0s

running (1m15.0s), 30/30 VUs, 1586 complete and 0 interrupted iterations
default   [  28% ] 30/30 VUs  1m15.0s/4m30.0s

running (1m16.0s), 30/30 VUs, 1606 complete and 0 interrupted iterations
default   [  28% ] 30/30 VUs  1m16.0s/4m30.0s

running (1m17.0s), 30/30 VUs, 1642 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  1m17.0s/4m30.0s

running (1m18.0s), 30/30 VUs, 1646 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  1m18.0s/4m30.0s

running (1m19.0s), 30/30 VUs, 1655 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  1m19.0s/4m30.0s

running (1m20.0s), 30/30 VUs, 1688 complete and 0 interrupted iterations
default   [  30% ] 30/30 VUs  1m20.0s/4m30.0s

running (1m21.0s), 30/30 VUs, 1739 complete and 0 interrupted iterations
default   [  30% ] 30/30 VUs  1m21.0s/4m30.0s

running (1m22.0s), 30/30 VUs, 1783 complete and 0 interrupted iterations
default   [  30% ] 30/30 VUs  1m22.0s/4m30.0s

running (1m23.0s), 30/30 VUs, 1823 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  1m23.0s/4m30.0s

running (1m24.0s), 30/30 VUs, 1840 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  1m24.0s/4m30.0s

running (1m25.0s), 30/30 VUs, 1858 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  1m25.0s/4m30.0s

running (1m26.0s), 30/30 VUs, 1863 complete and 0 interrupted iterations
default   [  32% ] 30/30 VUs  1m26.0s/4m30.0s

running (1m27.0s), 30/30 VUs, 1863 complete and 0 interrupted iterations
default   [  32% ] 30/30 VUs  1m27.0s/4m30.0s

running (1m28.0s), 30/30 VUs, 1890 complete and 0 interrupted iterations
default   [  33% ] 30/30 VUs  1m28.0s/4m30.0s

running (1m29.0s), 30/30 VUs, 1925 complete and 0 interrupted iterations
default   [  33% ] 30/30 VUs  1m29.0s/4m30.0s

running (1m30.0s), 30/30 VUs, 1933 complete and 0 interrupted iterations
default   [  33% ] 30/30 VUs  1m30.0s/4m30.0s

running (1m31.0s), 30/30 VUs, 1944 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m31.0s/4m30.0s

running (1m32.0s), 30/30 VUs, 1978 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m32.0s/4m30.0s

running (1m33.0s), 30/30 VUs, 1980 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m33.0s/4m30.0s

running (1m34.0s), 30/30 VUs, 1980 complete and 0 interrupted iterations
default   [  35% ] 30/30 VUs  1m34.0s/4m30.0s

running (1m35.0s), 30/30 VUs, 2018 complete and 0 interrupted iterations
default   [  35% ] 30/30 VUs  1m35.0s/4m30.0s

running (1m36.0s), 30/30 VUs, 2041 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m36.0s/4m30.0s

running (1m37.0s), 30/30 VUs, 2047 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m37.0s/4m30.0s

running (1m38.0s), 30/30 VUs, 2105 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m38.0s/4m30.0s

running (1m39.0s), 30/30 VUs, 2162 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m39.0s/4m30.0s

running (1m40.0s), 30/30 VUs, 2198 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m40.0s/4m30.0s

running (1m41.0s), 30/30 VUs, 2200 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m41.0s/4m30.0s

running (1m42.0s), 30/30 VUs, 2231 complete and 0 interrupted iterations
default   [  38% ] 30/30 VUs  1m42.0s/4m30.0s

running (1m43.0s), 30/30 VUs, 2278 complete and 0 interrupted iterations
default   [  38% ] 30/30 VUs  1m43.0s/4m30.0s

running (1m44.0s), 30/30 VUs, 2325 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m44.0s/4m30.0s

running (1m45.0s), 30/30 VUs, 2368 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m45.0s/4m30.0s

running (1m46.0s), 30/30 VUs, 2412 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m46.0s/4m30.0s

running (1m47.0s), 30/30 VUs, 2416 complete and 0 interrupted iterations
default   [  40% ] 30/30 VUs  1m47.0s/4m30.0s

running (1m48.0s), 30/30 VUs, 2429 complete and 0 interrupted iterations
default   [  40% ] 30/30 VUs  1m48.0s/4m30.0s

running (1m49.0s), 30/30 VUs, 2492 complete and 0 interrupted iterations
default   [  40% ] 30/30 VUs  1m49.0s/4m30.0s

running (1m50.0s), 30/30 VUs, 2523 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m50.0s/4m30.0s

running (1m51.0s), 30/30 VUs, 2546 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m51.0s/4m30.0s

running (1m52.0s), 30/30 VUs, 2555 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m52.0s/4m30.0s

running (1m53.0s), 30/30 VUs, 2587 complete and 0 interrupted iterations
default   [  42% ] 30/30 VUs  1m53.0s/4m30.0s

running (1m54.0s), 30/30 VUs, 2594 complete and 0 interrupted iterations
default   [  42% ] 30/30 VUs  1m54.0s/4m30.0s

running (1m55.0s), 30/30 VUs, 2603 complete and 0 interrupted iterations
default   [  43% ] 30/30 VUs  1m55.0s/4m30.0s

running (1m56.0s), 30/30 VUs, 2623 complete and 0 interrupted iterations
default   [  43% ] 30/30 VUs  1m56.0s/4m30.0s

running (1m57.0s), 30/30 VUs, 2661 complete and 0 interrupted iterations
default   [  43% ] 30/30 VUs  1m57.0s/4m30.0s

running (1m58.0s), 30/30 VUs, 2688 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  1m58.0s/4m30.0s

running (1m59.0s), 30/30 VUs, 2688 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  1m59.0s/4m30.0s

running (2m00.0s), 30/30 VUs, 2690 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  2m00.0s/4m30.0s

running (2m01.0s), 30/30 VUs, 2745 complete and 0 interrupted iterations
default   [  45% ] 30/30 VUs  2m01.0s/4m30.0s

running (2m02.0s), 30/30 VUs, 2787 complete and 0 interrupted iterations
default   [  45% ] 30/30 VUs  2m02.0s/4m30.0s

running (2m03.0s), 30/30 VUs, 2828 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  2m03.0s/4m30.0s

running (2m04.0s), 30/30 VUs, 2859 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  2m04.0s/4m30.0s

running (2m05.0s), 30/30 VUs, 2875 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  2m05.0s/4m30.0s

running (2m06.0s), 30/30 VUs, 2888 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  2m06.0s/4m30.0s

running (2m07.0s), 30/30 VUs, 2925 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  2m07.0s/4m30.0s

running (2m08.0s), 30/30 VUs, 2925 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  2m08.0s/4m30.0s

running (2m09.0s), 30/30 VUs, 2925 complete and 0 interrupted iterations
default   [  48% ] 30/30 VUs  2m09.0s/4m30.0s

running (2m10.0s), 30/30 VUs, 2971 complete and 0 interrupted iterations
default   [  48% ] 30/30 VUs  2m10.0s/4m30.0s

running (2m11.0s), 30/30 VUs, 2987 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  2m11.0s/4m30.0s

running (2m12.0s), 30/30 VUs, 2987 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  2m12.0s/4m30.0s

running (2m13.0s), 30/30 VUs, 3004 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  2m13.0s/4m30.0s

running (2m14.0s), 30/30 VUs, 3061 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  2m14.0s/4m30.0s

running (2m15.0s), 30/30 VUs, 3062 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  2m15.0s/4m30.0s

running (2m16.0s), 30/30 VUs, 3062 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  2m16.0s/4m30.0s

running (2m17.0s), 30/30 VUs, 3079 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  2m17.0s/4m30.0s

running (2m18.0s), 30/30 VUs, 3079 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  2m18.0s/4m30.0s

running (2m19.0s), 30/30 VUs, 3088 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  2m19.0s/4m30.0s

running (2m20.0s), 30/30 VUs, 3163 complete and 0 interrupted iterations
default   [  52% ] 30/30 VUs  2m20.0s/4m30.0s

running (2m21.0s), 30/30 VUs, 3182 complete and 0 interrupted iterations
default   [  52% ] 30/30 VUs  2m21.0s/4m30.0s

running (2m22.0s), 30/30 VUs, 3182 complete and 0 interrupted iterations
default   [  53% ] 30/30 VUs  2m22.0s/4m30.0s

running (2m23.0s), 30/30 VUs, 3199 complete and 0 interrupted iterations
default   [  53% ] 30/30 VUs  2m23.0s/4m30.0s

running (2m24.0s), 30/30 VUs, 3204 complete and 0 interrupted iterations
default   [  53% ] 30/30 VUs  2m24.0s/4m30.0s

running (2m25.0s), 30/30 VUs, 3204 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  2m25.0s/4m30.0s

running (2m26.0s), 30/30 VUs, 3246 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  2m26.0s/4m30.0s

running (2m27.0s), 30/30 VUs, 3298 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  2m27.0s/4m30.0s

running (2m28.0s), 30/30 VUs, 3317 complete and 0 interrupted iterations
default   [  55% ] 30/30 VUs  2m28.0s/4m30.0s

running (2m29.0s), 30/30 VUs, 3320 complete and 0 interrupted iterations
default   [  55% ] 30/30 VUs  2m29.0s/4m30.0s

running (2m30.0s), 30/30 VUs, 3346 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  2m30.0s/4m30.0s

running (2m31.0s), 30/30 VUs, 3386 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  2m31.0s/4m30.0s

running (2m32.0s), 30/30 VUs, 3386 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  2m32.0s/4m30.0s

running (2m33.0s), 30/30 VUs, 3394 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  2m33.0s/4m30.0s

running (2m34.0s), 30/30 VUs, 3436 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  2m34.0s/4m30.0s

running (2m35.0s), 30/30 VUs, 3471 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  2m35.0s/4m30.0s

running (2m36.0s), 30/30 VUs, 3514 complete and 0 interrupted iterations
default   [  58% ] 30/30 VUs  2m36.0s/4m30.0s

running (2m37.0s), 30/30 VUs, 3540 complete and 0 interrupted iterations
default   [  58% ] 30/30 VUs  2m37.0s/4m30.0s

running (2m38.0s), 30/30 VUs, 3556 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  2m38.0s/4m30.0s

running (2m39.0s), 30/30 VUs, 3578 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  2m39.0s/4m30.0s

running (2m40.0s), 30/30 VUs, 3585 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  2m40.0s/4m30.0s

running (2m41.0s), 30/30 VUs, 3606 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  2m41.0s/4m30.0s

running (2m42.0s), 30/30 VUs, 3631 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  2m42.0s/4m30.0s

running (2m43.0s), 30/30 VUs, 3634 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  2m43.0s/4m30.0s

running (2m44.0s), 30/30 VUs, 3643 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  2m44.0s/4m30.0s

running (2m45.0s), 30/30 VUs, 3664 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  2m45.0s/4m30.0s

running (2m46.0s), 30/30 VUs, 3703 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  2m46.0s/4m30.0s

running (2m47.0s), 30/30 VUs, 3739 complete and 0 interrupted iterations
default   [  62% ] 30/30 VUs  2m47.0s/4m30.0s

running (2m48.0s), 30/30 VUs, 3750 complete and 0 interrupted iterations
default   [  62% ] 30/30 VUs  2m48.0s/4m30.0s

running (2m49.0s), 30/30 VUs, 3759 complete and 0 interrupted iterations
default   [  63% ] 30/30 VUs  2m49.0s/4m30.0s

running (2m50.0s), 30/30 VUs, 3799 complete and 0 interrupted iterations
default   [  63% ] 30/30 VUs  2m50.0s/4m30.0s

running (2m51.0s), 30/30 VUs, 3859 complete and 0 interrupted iterations
default   [  63% ] 30/30 VUs  2m51.0s/4m30.0s

running (2m52.0s), 30/30 VUs, 3862 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  2m52.0s/4m30.0s

running (2m53.0s), 30/30 VUs, 3862 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  2m53.0s/4m30.0s

running (2m54.0s), 30/30 VUs, 3891 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  2m54.0s/4m30.0s

running (2m55.0s), 30/30 VUs, 3930 complete and 0 interrupted iterations
default   [  65% ] 30/30 VUs  2m55.0s/4m30.0s

running (2m56.0s), 30/30 VUs, 3946 complete and 0 interrupted iterations
default   [  65% ] 30/30 VUs  2m56.0s/4m30.0s

running (2m57.0s), 30/30 VUs, 3951 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  2m57.0s/4m30.0s

running (2m58.0s), 30/30 VUs, 3977 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  2m58.0s/4m30.0s

running (2m59.0s), 30/30 VUs, 4000 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  2m59.0s/4m30.0s

running (3m00.0s), 30/30 VUs, 4000 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  3m00.0s/4m30.0s

running (3m01.0s), 30/30 VUs, 4025 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  3m01.0s/4m30.0s

running (3m02.0s), 30/30 VUs, 4094 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  3m02.0s/4m30.0s

running (3m03.0s), 30/30 VUs, 4136 complete and 0 interrupted iterations
default   [  68% ] 30/30 VUs  3m03.0s/4m30.0s

running (3m04.0s), 30/30 VUs, 4167 complete and 0 interrupted iterations
default   [  68% ] 30/30 VUs  3m04.0s/4m30.0s

running (3m05.0s), 30/30 VUs, 4210 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  3m05.0s/4m30.0s

running (3m06.0s), 30/30 VUs, 4251 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  3m06.0s/4m30.0s

running (3m07.0s), 30/30 VUs, 4253 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  3m07.0s/4m30.0s

running (3m08.0s), 30/30 VUs, 4258 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  3m08.0s/4m30.0s

running (3m09.0s), 30/30 VUs, 4299 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  3m09.0s/4m30.0s

running (3m10.0s), 30/30 VUs, 4303 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  3m10.0s/4m30.0s

running (3m11.0s), 30/30 VUs, 4303 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  3m11.0s/4m30.0s

running (3m12.0s), 30/30 VUs, 4338 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  3m12.0s/4m30.0s

running (3m13.0s), 30/30 VUs, 4409 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  3m13.0s/4m30.0s

running (3m14.0s), 30/30 VUs, 4460 complete and 0 interrupted iterations
default   [  72% ] 30/30 VUs  3m14.0s/4m30.0s

running (3m15.0s), 30/30 VUs, 4502 complete and 0 interrupted iterations
default   [  72% ] 30/30 VUs  3m15.0s/4m30.0s

running (3m16.0s), 30/30 VUs, 4537 complete and 0 interrupted iterations
default   [  73% ] 30/30 VUs  3m16.0s/4m30.0s

running (3m17.0s), 30/30 VUs, 4576 complete and 0 interrupted iterations
default   [  73% ] 30/30 VUs  3m17.0s/4m30.0s

running (3m18.0s), 30/30 VUs, 4578 complete and 0 interrupted iterations
default   [  73% ] 30/30 VUs  3m18.0s/4m30.0s

running (3m19.0s), 30/30 VUs, 4593 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  3m19.0s/4m30.0s

running (3m20.0s), 30/30 VUs, 4627 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  3m20.0s/4m30.0s

running (3m21.0s), 30/30 VUs, 4632 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  3m21.0s/4m30.0s

running (3m22.0s), 30/30 VUs, 4634 complete and 0 interrupted iterations
default   [  75% ] 30/30 VUs  3m22.0s/4m30.0s

running (3m23.0s), 30/30 VUs, 4676 complete and 0 interrupted iterations
default   [  75% ] 30/30 VUs  3m23.0s/4m30.0s

running (3m24.0s), 30/30 VUs, 4730 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  3m24.0s/4m30.0s

running (3m25.0s), 30/30 VUs, 4771 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  3m25.0s/4m30.0s

running (3m26.0s), 30/30 VUs, 4776 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  3m26.0s/4m30.0s

running (3m27.0s), 30/30 VUs, 4821 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  3m27.0s/4m30.0s

running (3m28.0s), 30/30 VUs, 4851 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  3m28.0s/4m30.0s

running (3m29.0s), 30/30 VUs, 4890 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  3m29.0s/4m30.0s

running (3m30.0s), 30/30 VUs, 4905 complete and 0 interrupted iterations
default   [  78% ] 30/30 VUs  3m30.0s/4m30.0s

running (3m31.0s), 30/30 VUs, 4914 complete and 0 interrupted iterations
default   [  78% ] 30/30 VUs  3m31.0s/4m30.0s

running (3m32.0s), 30/30 VUs, 4935 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  3m32.0s/4m30.0s

running (3m33.0s), 30/30 VUs, 4966 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  3m33.0s/4m30.0s

running (3m34.0s), 30/30 VUs, 4967 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  3m34.0s/4m30.0s

running (3m35.0s), 30/30 VUs, 4970 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  3m35.0s/4m30.0s

running (3m36.0s), 30/30 VUs, 5003 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  3m36.0s/4m30.0s

running (3m37.0s), 30/30 VUs, 5003 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  3m37.0s/4m30.0s

running (3m38.0s), 30/30 VUs, 5028 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  3m38.0s/4m30.0s

running (3m39.0s), 30/30 VUs, 5075 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  3m39.0s/4m30.0s

running (3m40.0s), 30/30 VUs, 5111 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  3m40.0s/4m30.0s

running (3m41.0s), 30/30 VUs, 5133 complete and 0 interrupted iterations
default   [  82% ] 30/30 VUs  3m41.0s/4m30.0s

running (3m42.0s), 30/30 VUs, 5177 complete and 0 interrupted iterations
default   [  82% ] 30/30 VUs  3m42.0s/4m30.0s

running (3m43.0s), 30/30 VUs, 5185 complete and 0 interrupted iterations
default   [  83% ] 30/30 VUs  3m43.0s/4m30.0s

running (3m44.0s), 30/30 VUs, 5185 complete and 0 interrupted iterations
default   [  83% ] 30/30 VUs  3m44.0s/4m30.0s

running (3m45.0s), 30/30 VUs, 5229 complete and 0 interrupted iterations
default   [  83% ] 30/30 VUs  3m45.0s/4m30.0s

running (3m46.0s), 30/30 VUs, 5303 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  3m46.0s/4m30.0s

running (3m47.0s), 30/30 VUs, 5340 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  3m47.0s/4m30.0s

running (3m48.0s), 30/30 VUs, 5340 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  3m48.0s/4m30.0s

running (3m49.0s), 30/30 VUs, 5341 complete and 0 interrupted iterations
default   [  85% ] 30/30 VUs  3m49.0s/4m30.0s

running (3m50.0s), 30/30 VUs, 5371 complete and 0 interrupted iterations
default   [  85% ] 30/30 VUs  3m50.0s/4m30.0s

running (3m51.0s), 30/30 VUs, 5414 complete and 0 interrupted iterations
default   [  86% ] 30/30 VUs  3m51.0s/4m30.0s

running (3m52.0s), 30/30 VUs, 5420 complete and 0 interrupted iterations
default   [  86% ] 30/30 VUs  3m52.0s/4m30.0s

running (3m53.0s), 30/30 VUs, 5420 complete and 0 interrupted iterations
default   [  86% ] 30/30 VUs  3m53.0s/4m30.0s

running (3m54.0s), 30/30 VUs, 5433 complete and 0 interrupted iterations
default   [  87% ] 30/30 VUs  3m54.0s/4m30.0s

running (3m55.0s), 30/30 VUs, 5461 complete and 0 interrupted iterations
default   [  87% ] 30/30 VUs  3m55.0s/4m30.0s

running (3m56.0s), 30/30 VUs, 5464 complete and 0 interrupted iterations
default   [  87% ] 30/30 VUs  3m56.0s/4m30.0s

running (3m57.0s), 30/30 VUs, 5481 complete and 0 interrupted iterations
default   [  88% ] 30/30 VUs  3m57.0s/4m30.0s

running (3m58.0s), 30/30 VUs, 5528 complete and 0 interrupted iterations
default   [  88% ] 30/30 VUs  3m58.0s/4m30.0s

running (3m59.0s), 30/30 VUs, 5544 complete and 0 interrupted iterations
default   [  89% ] 30/30 VUs  3m59.0s/4m30.0s

running (4m00.0s), 30/30 VUs, 5549 complete and 0 interrupted iterations
default   [  89% ] 30/30 VUs  4m00.0s/4m30.0s

running (4m01.0s), 30/30 VUs, 5572 complete and 0 interrupted iterations
default   [  89% ] 30/30 VUs  4m01.0s/4m30.0s

running (4m02.0s), 29/30 VUs, 5600 complete and 0 interrupted iterations
default   [  90% ] 29/30 VUs  4m02.0s/4m30.0s

running (4m03.0s), 29/30 VUs, 5607 complete and 0 interrupted iterations
default   [  90% ] 29/30 VUs  4m03.0s/4m30.0s

running (4m04.0s), 28/30 VUs, 5622 complete and 0 interrupted iterations
default   [  90% ] 28/30 VUs  4m04.0s/4m30.0s

running (4m05.0s), 26/30 VUs, 5663 complete and 0 interrupted iterations
default   [  91% ] 26/30 VUs  4m05.0s/4m30.0s

running (4m06.0s), 26/30 VUs, 5694 complete and 0 interrupted iterations
default   [  91% ] 26/30 VUs  4m06.0s/4m30.0s

running (4m07.0s), 26/30 VUs, 5694 complete and 0 interrupted iterations
default   [  91% ] 26/30 VUs  4m07.0s/4m30.0s

running (4m08.0s), 23/30 VUs, 5725 complete and 0 interrupted iterations
default   [  92% ] 23/30 VUs  4m08.0s/4m30.0s

running (4m09.0s), 22/30 VUs, 5798 complete and 0 interrupted iterations
default   [  92% ] 22/30 VUs  4m09.0s/4m30.0s

running (4m10.0s), 21/30 VUs, 5837 complete and 0 interrupted iterations
default   [  93% ] 21/30 VUs  4m10.0s/4m30.0s

running (4m11.0s), 21/30 VUs, 5837 complete and 0 interrupted iterations
default   [  93% ] 21/30 VUs  4m11.0s/4m30.0s

running (4m12.0s), 21/30 VUs, 5841 complete and 0 interrupted iterations
default   [  93% ] 21/30 VUs  4m12.0s/4m30.0s

running (4m13.0s), 18/30 VUs, 5870 complete and 0 interrupted iterations
default   [  94% ] 18/30 VUs  4m13.0s/4m30.0s

running (4m14.0s), 18/30 VUs, 5886 complete and 0 interrupted iterations
default   [  94% ] 18/30 VUs  4m14.0s/4m30.0s

running (4m15.0s), 18/30 VUs, 5893 complete and 0 interrupted iterations
default   [  94% ] 18/30 VUs  4m15.0s/4m30.0s

running (4m16.0s), 18/30 VUs, 5895 complete and 0 interrupted iterations
default   [  95% ] 18/30 VUs  4m16.0s/4m30.0s

running (4m17.0s), 14/30 VUs, 5916 complete and 0 interrupted iterations
default   [  95% ] 14/30 VUs  4m17.0s/4m30.0s

running (4m18.0s), 13/30 VUs, 5951 complete and 0 interrupted iterations
default   [  96% ] 13/30 VUs  4m18.0s/4m30.0s

running (4m19.0s), 12/30 VUs, 5974 complete and 0 interrupted iterations
default   [  96% ] 12/30 VUs  4m19.0s/4m30.0s

running (4m20.0s), 12/30 VUs, 5974 complete and 0 interrupted iterations
default   [  96% ] 12/30 VUs  4m20.0s/4m30.0s

running (4m21.0s), 10/30 VUs, 5985 complete and 0 interrupted iterations
default   [  97% ] 10/30 VUs  4m21.0s/4m30.0s

running (4m22.0s), 09/30 VUs, 6021 complete and 0 interrupted iterations
default   [  97% ] 09/30 VUs  4m22.0s/4m30.0s

running (4m23.0s), 08/30 VUs, 6048 complete and 0 interrupted iterations
default   [  97% ] 08/30 VUs  4m23.0s/4m30.0s

running (4m24.0s), 07/30 VUs, 6054 complete and 0 interrupted iterations
default   [  98% ] 07/30 VUs  4m24.0s/4m30.0s

running (4m25.0s), 06/30 VUs, 6075 complete and 0 interrupted iterations
default   [  98% ] 06/30 VUs  4m25.0s/4m30.0s

running (4m26.0s), 05/30 VUs, 6096 complete and 0 interrupted iterations
default   [  99% ] 05/30 VUs  4m26.0s/4m30.0s

running (4m27.0s), 04/30 VUs, 6113 complete and 0 interrupted iterations
default   [  99% ] 04/30 VUs  4m27.0s/4m30.0s

running (4m28.0s), 04/30 VUs, 6122 complete and 0 interrupted iterations
default   [  99% ] 04/30 VUs  4m28.0s/4m30.0s

running (4m29.0s), 04/30 VUs, 6128 complete and 0 interrupted iterations
default   [ 100% ] 04/30 VUs  4m29.0s/4m30.0s

running (4m30.0s), 01/30 VUs, 6136 complete and 0 interrupted iterations
default   [ 100% ] 01/30 VUs  4m30.0s/4m30.0s

running (4m30.2s), 00/30 VUs, 6137 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  4m30s

running (4m30.2s), 00/30 VUs, 6137 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  4m30s

running (4m30.2s), 00/30 VUs, 6137 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  4m30s

running (4m30.2s), 00/30 VUs, 6137 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  4m30s

running (4m30.2s), 00/30 VUs, 6137 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  4m30s

running (4m30.2s), 00/30 VUs, 6137 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  4m30s

running (4m30.2s), 00/30 VUs, 6137 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  4m30s

     ✗ status 200
      ↳  93% — ✓ 5713 / ✗ 424

     checks.........................: 93.09% ✓ 5713      ✗ 424 
     data_received..................: 1.7 MB 6.5 kB/s
     data_sent......................: 1.1 MB 4.0 kB/s
     http_req_blocked...............: avg=9.24µs   min=1.94µs  med=5.09µs   max=4.13ms   p(90)=7.77µs   p(95)=9.47µs  
     http_req_connecting............: avg=2.06µs   min=0s      med=0s       max=821.88µs p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=907.37ms min=1.56ms  med=388.6ms  max=5.76s    p(90)=2.69s    p(95)=2.92s   
       { expected_response:true }...: avg=904.52ms min=20.36ms med=392.37ms max=5.76s    p(90)=2.68s    p(95)=2.92s   
   ✓ http_req_failed................: 6.90%  ✓ 424       ✗ 5713
     http_req_receiving.............: avg=148.25µs min=13.2µs  med=103.11µs max=8.36ms   p(90)=161.55µs p(95)=322.44µs
     http_req_sending...............: avg=47µs     min=10.03µs med=43.46µs  max=519.15µs p(90)=77.51µs  p(95)=94.96µs 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=907.18ms min=1.44ms  med=388.45ms max=5.75s    p(90)=2.69s    p(95)=2.92s   
     http_reqs......................: 6137   22.714014/s
     iteration_duration.............: avg=1.1s     min=54.99ms med=597.36ms max=6.02s    p(90)=2.88s    p(95)=3.13s   
     iterations.....................: 6137   22.714014/s
     test_errors....................: 424    1.569291/s
     test_latency_ms................: avg=907.54ms min=1ms     med=389ms    max=5.76s    p(90)=2.69s    p(95)=2.92s   
     test_slow_requests.............: 1329   4.91884/s
     vus............................: 1      min=1       max=30
     vus_max........................: 30     min=30      max=30


running (4m30.2s), 00/30 VUs, 6137 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  4m30s